# 2. How to read  tabular data file into Pandas ?

In [1]:
import pandas as pd #importing pandas 
orders = pd.read_table ('http://bit.ly/chiporders') #importing data and saving it as data frame object.

In [ ]:
orders.head(2) #displaying data frame created above , by deafult head() shows top 5 rows & tail() below 5 rows.

In [ ]:
# Notes:By default read_table assumes 
# 1 - file is tab seperated.
# 2 - 1st row is header row.

### 2.1 Handling "non tab seperated " and "Header less" data.

In [6]:
pd.read_table ('http://bit.ly/movieusers').head(3)

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537

In [ ]:
# Notes:  
# 1 - file doesnt have header
# 2 - Columns are seperated with | charecter.

In [8]:
pd.read_table ('http://bit.ly/movieusers',sep = '|',header = None).head(3)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067

In [ ]:
# By default Pandas provided integers as header names. Header names added.

###  2.2 Adding Header Names

In [9]:
user_cols = ["user_id","age","occupation","ZIP_Code"] #creating a list with column names.
pd.read_table ('http://bit.ly/movieusers',sep = '|',header = None,names = user_cols).head(3)

   user_id age  occupation ZIP_Code
1       24   M  technician    85711
2       53   F       other    94043
3       23   M      writer    32067

In [ ]:
#Notes:
# 1- List is created with column names 
# 2- While importing data "names" is used to assign colum name